# NumberSystemOrientation Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..NumberSystemOrientation Property
ParameterTypeId Class See Also
---
"Orientation"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId NumberSystemOrientation { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property NumberSystemOrientation As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ NumberSystemOrientation {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace